app/controllers/books_controller.rb

  def show
    @books = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "new test book"], ["description", ""], ["created_at", "2024-05-09 18:09:58.613847"], ["updated_at", "2024-05-09 18:09:58.613847"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "updated_at" = ? WHERE "books"."id" = ?  [["updated_at", "2024-05-09 18:09:58.646152"], ["id", 4]]