app/controllers/users_controller.rb

  def index
   app_response(message: 'All data', status: :ok, data: User.all)
---
SELECT "users".* FROM "users"

  def create
    user = User.new(user_params)
    binding.irb
    if user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["username", "Ian_Code"], ["email", "kian99564@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2024-02-26 21:23:08.270410"], ["updated_at", "2024-02-26 21:23:08.270410"]]